"""
ГЛАВА 1
ОСНОВНЫЕ ПРИЁМЫ ПРОГРАММИРОВАНИЯ
3. Простейшая целочисленная арифметика
71. Дано действительное число a. Вычислить f(a), где f —
периодическая функция с периодом 1.5, совпадающая на отрезке [0, 1.5]:

а) с функцией x³ − 2.25x;
б) с функцией, график которой изображён на рис. 4.
"""

# ==================== ЧАСТЬ a) ====================
def f_a(x):
    """Функция f(x) = x³ − 2.25x на отрезке [0, 1.5]"""
    return x**3 - 2.25*x


def calculate_f_a(a):
    """Вычисляет f(a) для периодической функции с периодом 1.5"""
    period = 1.5
    x = a % period  # приведение к [0, 1.5)
    return f_a(x), x


# ==================== ЧАСТЬ б) ====================
def f_b(x):
    """
    Периодическая функция f(x) из графика (рис. 4).
    На одном периоде [0, 1.5] она образует равнобедренный треугольник:
      f(0) = −0.5,  f(0.75) = 1,  f(1.5) = −0.5
    """
    x = x % 1.5
    if x <= 0.75:
        return -0.5 + 2 * x           # восходящий участок
    else:
        return 1 - 2 * (x - 0.75)     # нисходящий участок


def calculate_f_b(a):
    """Вычисляет f(a) для функции из графика (период 1.5)"""
    period = 1.5
    x = a % period
    return f_b(x), x


# ==================== ОСНОВНОЙ ВВОД ====================

print("Введите значение a:")
a = float(input("a = "))

print(f"\n{'='*60}")
print("Вычисление периодической функции f(a) с периодом T = 1.5")
print(f"{'='*60}")

# --- Часть a ---
result_a, x_a = calculate_f_a(a)
print(f"\nа) f(x) = x³ − 2.25x на [0, 1.5]")
print(f"   a = {a}")
print(f"   a mod 1.5 = {x_a:.4f}")
print(f"   f({a}) = f({x_a:.4f}) = {result_a:.4f}")

# --- Часть б ---
result_b, x_b = calculate_f_b(a)
print(f"\nб) f(x) — функция из графика (рис. 4)")
print(f"   a = {a}")
print(f"   a mod 1.5 = {x_b:.4f}")
print(f"   f({a}) = f({x_b:.4f}) = {result_b:.4f}")


# ==================== ПРИМЕРЫ ====================

print(f"\n{'='*60}")
print("--- Примеры вычислений ---\n")

test_values = [0, 0.75, 1.5, 2.25, 3, -0.75, -1.5]

print("Часть a) f(x) = x³ − 2.25x:")
print(f"{'a':>8} | {'a mod 1.5':>10} | {'f(a)':>10}")
print("-" * 35)
for val in test_values:
    result, x = calculate_f_a(val)
    print(f"{val:8.2f} | {x:10.4f} | {result:10.4f}")

print("\n" + "="*60)
print("Часть б) f(x) из графика:")
print(f"{'a':>8} | {'a mod 1.5':>10} | {'f(a)':>10}")
print("-" * 35)
for val in test_values:
    result, x = calculate_f_b(val)
    print(f"{val:8.2f} | {x:10.4f} | {result:10.4f}")


# ==================== ГРАФИКИ (текстовые) ====================

print(f"\n{'='*60}")
print("--- График функции а) ---\n")
print("x\t\tf(x) = x³ − 2.25x")
print("-" * 40)
for i in range(16):
    x = i * 1.5 / 15
    y = f_a(x)
    bar = "■" * max(0, int((y + 2) * 5))  # небольшое смещение для визуализации
    print(f"{x:5.2f}\t\t{y:7.3f} {bar}")

print(f"\n{'='*60}")
print("--- График функции б) ---\n")
print("x\t\tf(x) из графика")
print("-" * 40)
for i in range(16):
    x = i * 1.5 / 15
    y = f_b(x)
    bar = "■" * max(0, int((y + 0.5) * 10))
    print(f"{x:5.2f}\t\t{y:7.3f} {bar}")

input("\nНажмите Enter, чтобы завершить программу.")
