"""
ГЛАВА 1
ОСНОВНЫЕ ПРИЁМЫ ПРОГРАММИРОВАНИЯ
3. Простейшая целочисленная арифметика
73. Даны целые числа k, l. Если числа не равны, то заменить
каждое из них одним и тем же числом, равным большему из исходных,
а если равны, то заменить числа нулями.
"""


# ==================== ВВОД ДАННЫХ ====================
print("Введите целые числа k и l:")
k = int(input("k = "))
l = int(input("l = "))

print(f"\n{'='*50}")
print("Исходные значения:")
print(f"k = {k}, l = {l}")
print(f"{'='*50}")

# ==================== ЛОГИКА ====================
if k != l:
    # Числа не равны — заменить оба на большее
    max_value = max(k, l)
    print(f"\nУсловие: k ≠ l ({k} ≠ {l}) ✓")
    print(f"Действие: заменить оба на больший = {max_value}")
    k_new = l_new = max_value
else:
    # Числа равны — заменить оба на нули
    print(f"\nУсловие: k = l ({k} = {l}) ✓")
    print("Действие: заменить оба на нули")
    k_new = l_new = 0

# ==================== ВЫВОД РЕЗУЛЬТАТОВ ====================
print(f"\nПреобразованные значения:")
print(f"k = {k_new}, l = {l_new}")


# ==================== ФУНКЦИЯ ====================
def replace_numbers(k, l):
    """
    Заменяет числа k и l согласно условию:
    - если k ≠ l → оба = max(k, l)
    - если k = l → оба = 0
    Возвращает кортеж (k_new, l_new)
    """
    return (max(k, l), max(k, l)) if k != l else (0, 0)


# ==================== ПРИМЕРЫ ====================
print(f"\n{'='*50}")
print("--- Примеры ---\n")

test_cases = [
    (5, 3),
    (7, -2),
    (4, 4),
    (0, 0),
    (-5, -10),
    (100, 50),
    (-3, -3),
    (1, -1),
]

print(f"{'k':>5} | {'l':>5} | {'Условие':>10} | {'k_new':>6} | {'l_new':>6} | Описание")
print("-" * 75)

for k_val, l_val in test_cases:
    k_result, l_result = replace_numbers(k_val, l_val)
    if k_val != l_val:
        condition = "≠"
        description = f"не равны → max({k_val}, {l_val}) = {k_result}"
    else:
        condition = "="
        description = "равны → оба = 0"
    print(f"{k_val:5d} | {l_val:5d} | {condition:>10} | {k_result:6d} | {l_result:6d} | {description}")

input("\nНажмите Enter, чтобы завершить программу.")
