"""
ГЛАВА 1
ОСНОВНЫЕ ПРИЁМЫ ПРОГРАММИРОВАНИЯ
3. Простейшая целочисленная арифметика
74. Дано натуральное n (n ≤ 100), определяющее возраст
человека (в годах). Дать для этого числа наименование «год», «года»
или «лет»: например, 1 год, 23 года, 45 лет и т. д.
"""

# ==================== ФУНКЦИЯ ====================

def get_age_word(n):
    """
    Возвращает правильное слово ('год', 'года' или 'лет')
    в зависимости от числа n.
    """
    # Исключения: 11–14 → "лет"
    if n % 100 in (11, 12, 13, 14):
        return "лет"
    
    last_digit = n % 10
    
    if last_digit == 1:
        return "год"
    elif last_digit in (2, 3, 4):
        return "года"
    else:
        return "лет"


# ==================== ВВОД ДАННЫХ ====================

print("Введите возраст (натуральное число, n ≤ 100):")
n = int(input("n = "))

# Проверка диапазона
if n < 1 or n > 100:
    print("Ошибка: возраст должен быть от 1 до 100.")
else:
    word = get_age_word(n)
    print(f"\n{'='*50}")
    print(f"Возраст: {n} {word}")
    print(f"{'='*50}")


# ==================== ТАБЛИЦЫ ====================

print(f"\n{'='*50}")
print("--- Таблица склонений ---\n")

print("Числа с 'год':")
years_1 = [i for i in range(1, 101) if get_age_word(i) == "год"]
print(", ".join(map(str, years_1)))

print("\nЧисла с 'года':")
years_2_4 = [i for i in range(1, 101) if get_age_word(i) == "года"]
print(", ".join(map(str, years_2_4)))

print("\nЧисла с 'лет':")
years_5_plus = [i for i in range(1, 101) if get_age_word(i) == "лет"]
print(", ".join(map(str, years_5_plus)))


# ==================== ПРИМЕРЫ ====================

print(f"\n{'='*50}")
print("--- Примеры ---\n")

examples = [1, 2, 3, 4, 5, 11, 12, 13, 14, 15,
            21, 22, 23, 24, 25, 31, 32, 33, 34, 35,
            41, 50, 100]

print(f"{'Возраст':>8} | {'Последние 2 цифры':>18} | {'Последняя цифра':>15} | {'Слово':>8} | Примечание")
print("-" * 85)

for age in examples:
    last_two = age % 100
    last_one = age % 10
    word = get_age_word(age)
    
    # Причина выбора формы
    if 11 <= last_two <= 14:
        note = "исключение (11–14)"
    elif last_one == 1:
        note = "оканчивается на 1"
    elif last_one in (2, 3, 4):
        note = "оканчивается на 2–4"
    else:
        note = "остальные"
    
    print(f"{age:8d} | {last_two:18d} | {last_one:15d} | {word:>8} | {note}")


# ==================== ВИЗУАЛИЗАЦИЯ ====================

print(f"\n{'='*50}")
print("--- Все числа от 1 до 100 ---\n")

for i in range(1, 101, 10):
    line = ""
    for j in range(i, min(i + 10, 101)):
        word = get_age_word(j)
        # Сокращения: г = год, го = года, л = лет
        if word == "год":
            abbr = "г"
        elif word == "года":
            abbr = "го"
        else:
            abbr = "л"
        line += f"{j:3d}{abbr} "
    print(line)

input("\nНажмите Enter, чтобы завершить программу.")
