"""
ГЛАВА 1
ОСНОВНЫЕ ПРИЁМЫ ПРОГРАММИРОВАНИЯ
11. Вложенные циклы в матричных задачах

397. Дана действительная квадратная матрица порядка 10. В строках с отрицательным элементом на главной диагонали найти: 
а) сумму всех элементов;
б) наибольший из всех элементов.
"""


import random

def get_matrix(n=10):
    """
    Выбор способа ввода действительной квадратной матрицы порядка n (по умолчанию 10).
    Возвращает матрицу (list of lists of float).
    """
    print(f"Задача 397: Анализ строк с отрицательным элементом на главной диагонали")
    print(f"Порядок матрицы: {n}")
    print("Выберите способ ввода:")
    print("1 — Ручной ввод")
    print("2 — Случайная генерация")
    print("3 — Готовые примеры")

    while True:
        choice = input("Ваш выбор (1/2/3): ").strip()
        if choice in ('1', '2', '3'):
            break
        print("Ошибка: выберите 1, 2 или 3.")

    if choice == '1':
        while True:
            try:
                print(f"Введите матрицу {n}x{n} построчно (действительные числа через пробел):")
                matrix = []
                for i in range(n):
                    row = list(map(float, input(f"Строка {i:1}: ").split()))
                    if len(row) != n:
                        print(f"Ошибка: в строке должен быть {n} чисел.")
                        break
                    matrix.append(row)
                else:
                    return matrix
                print("Попробуйте ввести матрицу заново.")
            except ValueError:
                print("Ошибка ввода. Ожидает числа.")

    elif choice == '2':
        matrix = [[round(random.uniform(-10, 10), 2) for _ in range(n)] for _ in range(n)]
        print("\nСгенерировано матрица:")
        for row in matrix:
            print(" ".join(f"{x:8.2f}" for x in row))
        return matrix
    
    else:
        # Готовые примеры 10x10
        examples = [
            # Пример 1: несколько строк с отрицательной диагональю
            [[ 2.5, -1.2, 3.0, 0.0, 5.5, -2.1, 7.3, 8.0, -9.0, 1.0],
             [ 0.0, -3.2, 1.0, 4.0, 6.0, 7.0, 8.0, 2.0, -1.0, 5.0],
             [ 1.0, 2.0, -4.0, 3.0, 0.0, -2.0, 1.5, 6.0, 4.0, -3.0],
             [ 0.5, 1.5, 2.5, 3.5, 4.5, 5.5, 6.5, 7.5, 8.5, 9.5],
             [ 1.0, 2.0, 3.0, 4.0, -7.0, 6.0, 5.0, 4.0, 3.0, 2.0],
             [ 2.0, 4.0, 6.0, 8.0, 10.0, 1.0, 3.0, 5.0, 7.0, 9.0],
             [ 3.0, -3.0, 3.0, -3.0, 3.0, -3.0, 3.0, -3.0, 3.0, -3.0],
             [ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, -1.0, 0.0, 0.0],
             [ 9.0, 8.0, 7.0, 6.0, 5.0, 4.0, 3.0, 2.0, 1.0, 0.0],
             [ 1.1, 2.2, 3.3, 4.4, 5.5, 6.6, 7.7, 8.8, 9.9, -5.0]],

            # Пример 2: все диагональные элементы отрицательные
            [[ -1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0],
             [ 10.0, -2.0, 8.0, 7.0, 6.0, 5.0, 4.0, 3.0, 2.0, 1.0],
             [ 1.0, 2.0, -3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0],
             [ 10.0, 9.0, 8.0, -4.0, 6.0, 5.0, 4.0, 3.0, 2.0, 1.0],
             [ 5.0, 5.0, 5.0, 5.0, -5.0, 5.0, 5.0, 5.0, 5.0, 5.0],
             [ -2.0, -2.0, -2.0, -2.0, -2.0, -6.0, -2.0, -2.0, -2.0, -2.0],
             [ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, -7.0, 0.0, 0.0, 0.0],
             [ 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, -8.0, 1.0, 1.0],
             [ 3.0, 3.0, 3.0, 3.0, 3.0, 3.0, 3.0, 3.0, -9.0, 3.0],
             [ 4.0, 4.0, 4.0, 4.0, 4.0, 4.0, 4.0, 4.0, 4.0, -10.0]],

            # Пример 3: ни одной строки с отрицательным элементом на диагонали
            [[ 1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0],
             [ 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0, 1.0],
             [ 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0, 1.0, 2.0],
             [ 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0, 1.0, 2.0, 3.0],
             [ 5.0, 6.0, 7.0, 8.0, 9.0, 10.0, 1.0, 2.0, 3.0, 4.0],
             [ 6.0, 7.0, 8.0, 9.0, 10.0, 1.0, 2.0, 3.0, 4.0, 5.0],
             [ 7.0, 8.0, 9.0, 10.0, 1.0, 2.0, 3.0, 4.0, 5.0, 6.0],
             [ 8.0, 9.0, 10.0, 1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0],
             [ 9.0, 10.0, 1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0],
             [ 10.0, 1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0]]
        ]
        print("\nГотовые примеры (матрицы 10x10):")
        for idx, mat in enumerate(examples, 1):
            print(f"{idx}:")
            for row in mat:
                print("  ", " ".join(f"{x:6.2f}" for x in row))
            print()
        while True:
            try:
                num = int(input("Выберите номер примера: "))
                if 1 <= num <= len(examples):
                    return examples[num - 1]
                else:
                    print(f"Номер должен быть от 1 до {len(examples)}.")
            except ValueError:
                print("Ошибка ввода. Введите целое число.")

def main():
    n = 10
    matrix = get_matrix(n)
    if matrix is None:
        return 
    
    # Строки с отрицательным элементом на главной диагонали
    target_rows = []
    for i in range(n):
        if matrix[i][i] < 0:
            row = matrix[i]
            row_sum = sum(row)
            row_max = max(row)
            target_rows.append((i + 1, row_sum, row_max, matrix[i][i]))

    # Вывод результатов
    print("\n" + "=" * 60)
    print("РЕЗУЛЬТАТЫ")
    print("=" * 60)
    print("Матрица 10x10:")
    for i, row in enumerate(matrix):
        diag = row[i]
        marker = " <-- отр." if diag < 0 else ""
        print(f"Строка {i+1:2d}:", " ".join(f"{x:7.2f}" for x in row), f"  диаг:{diag:7.2f}{marker}")

    if not target_rows:
        print("\nНет строк с отрицательным элементом на главной диагонали.")
    else:
        print("\nСтроки с отрицательным элементом на главной диагонали.")
        for i, s, m, diag in target_rows:
            print(f"Строка {i:2d}: сумма всех элементов = {s:.2f}, наибольший элемент = {m:.2f}")

        # Дополнительно: общая информация
        total_sum = sum(s for _, s, _, _ in target_rows)
        global_max = max(m for _, _, m, _ in target_rows)
        print(f"\nОбщая сумма элементов по всем таким строкам: {total_sum:.2f}")
        print(f"Максимальный элемент среди всех таких строк: {global_max:.2f}")
    print("=" * 60)

if __name__ == "__main__":
    main()
    input("\nНажмите Enter, чтобы завершить программу.")
