"""
ГЛАВА 1
ОСНОВНЫЕ ПРИЁМЫ ПРОГРАММИРОВАНИЯ
11. Вложенные циклы в матричных задачах

399. Дана действительная квадратная матрица порядка 9. Получить целочисленную квадратную матрицу того же порядка, в которой элемент равен единице, если соответствующий ему элемент исходной матрицы больше элемента, расположенного в его строке на главной диагонали, и равен нулю в противном случае.
"""


import random

def get_matrix(n=9):
    """
    Выбор способа ввода действительной квадратной матрицы порядка n (по умолчанию 9).
    Возвращает матрицу.
    """
    print(f"Задача 399: Построение бинарной матрицы по сравнению с диагональю")
    print(f"Порядок матрицы: {n}")
    print("Выберите способ ввода:")
    print("1 — Ручной ввод")
    print("2 — Случайная генерация")
    print("3 — Готовые примеры")

    while True:
        choice = input("Ваш выбор (1/2/3): ").strip()
        if choice in ('1', '2', '3'):
            break
        print("Ошибка: выберите 1, 2 или 3.")

    if choice == '1':
        while True:
            try:
                print(f"Введите матрицу {n}×{n} построчно (действительные числа через пробел):")
                matrix = []
                for i in range(n):
                    row = list(map(float, input(f"Строка {i+1}: ").split()))
                    if len(row) != n:
                        print(f"Ошибка: в строке должно быть {n} чисел.")
                        break
                    matrix.append(row)
                else:
                    return matrix
                print("Попробуйте ввести матрицу заново.")
            except ValueError:
                print("Ошибка ввода. Ожидаются числа.")

    elif choice == '2':
        matrix = [[round(random.uniform(-10, 10), 2) for _ in range(n)] for _ in range(n)]
        print("\nСгенерирована матрица:")
        for row in matrix:
            print(" ".join(f"{x:8.2f}" for x in row))
        return matrix

    else:
        # Готовые примеры 9x9
        examples = [
            # Пример 1: все диагональные элементы равны 0, остальные положительные
            [[0.0 if i == j else 1.0 for j in range(9)] for i in range(9)],
            # Пример 2: диагональные элементы -5, остальные от -10 до 10
            [[-5.0 if i == j else round(random.uniform(-10, 10), 1) for j in range(9)] for i in range(9)],
            # Пример 3: почти одинаковые строки с разными диагоналями
            [[(i+1)*0.5 + (0.2*j) for j in range(9)] for i in range(9)]
        ]
        # Для воспроизводимости зафиксируем пример 2 вручную, а не случайно
        examples[1] = [
            [-5.0, 3.0, -2.0, 0.0, 7.0, -1.0, 4.0, -6.0, 2.0],
            [1.0, -5.0, 3.0, -4.0, 6.0, 2.0, -3.0, 5.0, -1.0],
            [-2.0, 4.0, -5.0, 1.0, -3.0, 0.0, 2.0, -1.0, 3.0],
            [0.0, -1.0, 2.0, -5.0, 4.0, -2.0, 1.0, 3.0, -4.0],
            [3.0, -2.0, 1.0, -1.0, -5.0, 0.0, -3.0, 2.0, 4.0],
            [-4.0, 2.0, 0.0, 3.0, -1.0, -5.0, 1.0, -2.0, 0.0],
            [1.0, 1.0, 1.0, 1.0, 1.0, 1.0, -5.0, 1.0, 1.0],
            [5.0, 5.0, 5.0, 5.0, 5.0, 5.0, 5.0, -5.0, 5.0],
            [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, -5.0]
        ]
        examples[2] = [
            [0.5, 0.7, 0.9, 1.1, 1.3, 1.5, 1.7, 1.9, 2.1],
            [1.0, 1.2, 1.4, 1.6, 1.8, 2.0, 2.2, 2.4, 2.6],
            [1.5, 1.7, 1.9, 2.1, 2.3, 2.5, 2.7, 2.9, 3.1],
            [2.0, 2.2, 2.4, 2.6, 2.8, 3.0, 3.2, 3.4, 3.6],
            [2.5, 2.7, 2.9, 3.1, 3.3, 3.5, 3.7, 3.9, 4.1],
            [3.0, 3.2, 3.4, 3.6, 3.8, 4.0, 4.2, 4.4, 4.6],
            [3.5, 3.7, 3.9, 4.1, 4.3, 4.5, 4.7, 4.9, 5.1],
            [4.0, 4.2, 4.4, 4.6, 4.8, 5.0, 5.2, 5.4, 5.6],
            [4.5, 4.7, 4.9, 5.1, 5.3, 5.5, 5.7, 5.9, 6.1]
        ]

        print("\nГотовые примеры (матрицы 9×9):")
        for idx, mat in enumerate(examples, 1):
            print(f"{idx}:")
            for row in mat[:3]:  # покажем только первые 3 строки
                print("   ", " ".join(f"{x:6.2f}" for x in row))
            print("   ...")
            print()
        while True:
            try:
                num = int(input("Выберите номер примера: "))
                if 1 <= num <= len(examples):
                    return examples[num-1]
                else:
                    print(f"Номер должен быть от 1 до {len(examples)}.")
            except ValueError:
                print("Ошибка ввода. Введите целое число.")

def main():
    n = 9
    matrix = get_matrix(n)

    # Построение бинарной матрицы
    binary_matrix = []
    for i in range(n):
        diag_elem = matrix[i][i]
        new_row = [1 if matrix[i][j] > diag_elem else 0 for j in range(n)]
        binary_matrix.append(new_row)

    # Вывод результатов
    print("\n" + "="*70)
    print("РЕЗУЛЬТАТЫ")
    print("="*70)
    print("Исходная матрица:")
    for i, row in enumerate(matrix):
        print(f"Строка {i+1:2d}:", " ".join(f"{x:8.2f}" for x in row))

    print("\nБинарная матрица (1 – элемент > диагонального, 0 – иначе):")
    for i, row in enumerate(binary_matrix):
        print(f"Строка {i+1:2d}:", " ".join(f"{x:2d}" for x in row))

    print("\nПримечание: на главной диагонали всегда 0 (элемент не больше самого себя).")
    print("="*70)

if __name__ == "__main__":
    main()
    input("\nНажмите Enter, чтобы завершить программу.")
