"""
ГЛАВА 1
ОСНОВНЫЕ ПРИЁМЫ ПРОГРАММИРОВАНИЯ
11. Вложенные циклы в матричных задачах

408. Найти сумму квадратов тех элементов aij матрицы [aij]i,j = 1,..., 10, для которых выполнено 2 <= i <= 9, 2 <= j <= 9, aij >= (ai-1 + aij - 1 + ai+1j + ai+1j) / 4. 
"""


import random

def get_matrix(n=10):
    """Выбор способа ввода действительной квадратной матрицы порядка n (по умолчанию 10)."""
    print(f"Задача 408: Сумма квадратов «внутренних» элементов по условию")
    print(f"Порядок матрицы: {n}")
    print("Выберите способ ввода:")
    print("1 — Ручной ввод")
    print("2 — Случайная числа")
    print("3 — Готовые примеры")

    while True:
        choice = input("Ваш выбор (1/2/3): ").strip()
        if choice in ('1', '2', '3'):
            break
        print("Ошибка: выберите 1, 2 или 3.")

    if choice == '1':
        while True:
            try:
                print(f"Введите матрицу {n}x{n} построчно (действительные числа через пробел):")
                matrix = []
                for i in range(n):
                    row = list(map(float, input(f"Строка {i + 1}: ").split()))
                    if len(row) != n:
                        print(f"Ошибка: в строке должен быть {n} чисел.")
                        break
                    matrix.append(row)
                else:
                    return matrix
                print("Попробуйте ввести матрицу заново.")
            except ValueError:
                print("Ошибка ввода. Ожидает числа.")

    elif choice == '2':
        matrix = [[round(random.uniform(-5, 5), 2) for _ in range(n)] for _ in range(n)]
        print("\nСгенерирована матрица:")
        for row in matrix:
            print(" ".join(f"{x:7.2f}" for x in row))
        return matrix
    
    else:
        # Готовые примеры 10×10
        examples = [
            # Пример 1: все единицы – условие выполняется для всех внутренних элементов
            [[1.0 for _ in range(n)] for _ in range(n)],
            # Пример 2: центральный элемент больше соседей
            [[0.0 for _ in range(n)] for _ in range(n)],
            # Пример 3: случайные целые числа
            [[random.randint(-3, 3) for _ in range(n)] for _ in range(n)]
        ]
        # Для примера 2 установим вручную
        examples[1] = [
            [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
            [0.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 0.0],
            [0.0, 1.0, 2.0, 2.0, 2.0, 2.0, 2.0, 2.0, 1.0, 0.0],
            [0.0, 1.0, 2.0, 3.0, 3.0, 3.0, 3.0, 2.0, 1.0, 0.0],
            [0.0, 1.0, 2.0, 3.0, 4.0, 4.0, 3.0, 2.0, 1.0, 0.0],
            [0.0, 1.0, 2.0, 3.0, 4.0, 4.0, 3.0, 2.0, 1.0, 0.0],
            [0.0, 1.0, 2.0, 3.0, 3.0, 3.0, 3.0, 2.0, 1.0, 0.0],
            [0.0, 1.0, 2.0, 2.0, 2.0, 2.0, 2.0, 2.0, 1.0, 0.0],
            [0.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 0.0],
            [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]
        ]
        # Пример 3 сделаем детерминированным для наглядности
        examples[2] = [
            [ 1, -2,  3, -4,  5, -6,  7, -8,  9, -10],
            [-1,  2, -3,  4, -5,  6, -7,  8, -9,  10],
            [ 0,  0,  0,  0,  0,  0,  0,  0,  0,   0],
            [ 1,  1,  1,  1,  1,  1,  1,  1,  1,   1],
            [ 2,  2,  2,  2,  2,  2,  2,  2,  2,   2],
            [ 3,  3,  3,  3,  3,  3,  3,  3,  3,   3],
            [ 4,  4,  4,  4,  4,  4,  4,  4,  4,   4],
            [-1, -1, -1, -1, -1, -1, -1, -1, -1,  -1],
            [ 0,  5,  0,  5,  0,  5,  0,  5,  0,   5],
            [ 9,  9,  9,  9,  9,  9,  9,  9,  9,   9]
        ]

        print("\nГотовые примеры (матрицы 10x10):")
        for idx, mat in enumerate(examples, 1):
            print(f"{idx}:")
            for row in mat:
                print("  ", " ".join(f"{x:4.0f}" if isinstance(x, float) and x.is_integer() else f"{x:4.1f}" for x in row))
            print()
        while True:
            try:
                num = int(input("Выберите номер примера: "))
                if 1 <= num <= len(examples):
                    return examples[num - 1]
                else:
                    print(f"Номер должен быть от 1 до {len(examples)}.")
            except ValueError:
                print("Ошибка ввода. Введите целое число.")


def main():
    n = 10
    matrix = get_matrix(n)

    total = 0.0
    # Индексы внутри: строки 2..9, столбцы 2..9 -> в Python [1..8]
    for i in range(1, n - 1):
        for j in range(1, n - 1):
            a = matrix[i][j]
            avg_neighbors = (matrix[i - 1][j] + matrix[i][j - 1] + matrix[i + 1][j] + matrix[i][j + 1]) / 4.0
            if a >= avg_neighbors:
                total += a * a
    
    # Вывод результатов
    print("\n" + "=" * 60)
    print("РЕЗУЛЬТАТЫ")
    print("=" * 60)
    print("Матрица 10x10:")
    for i, row in enumerate(matrix):
        print(f"Строка {i+1:2d}:", " ".join(f"{x:7.2f}" for x in row))

    print("\nУсловие для элементов с индексами 2..9 (i,j = 2..10):")
    print("a[i][j] >= (a[i - 1][j] + a[i][j - 1] + a[i + 1][j] + a[i][j + 1]) / 4")
    print(f"\nСумма квадратов удовлетворяющих элементов = {total:.4f}")
    print("=" * 60)

if __name__  == "__main__":
    main()
    input("\nНажмите Enter, чтобы завершить программу.")
