"""
ГЛАВА 1 
ОСНОВНЫЕ ПРИЕМЫ ПРОГРАММИРОВАНИЯ
1. Арифметика действительных чисел. Вычисление по формулам.
1. Даны два действительных числа a и b. Получить их сумму, разность и произведение.
"""

# Ввод двух действительных чисел
a = float(input("Введите число a: "))
b = float(input("Введите число b: "))

# Вычисления
s = a + b  # сумма
d = a - b  # разность
p = a * b  # произведение

# Вывод результата
print("Сумма:", s)
print("Разность:", d)
print("Произведение:", p)

input("Нажмите любую клавишу, чтобы завершить работу программы.")
