"""
ГЛАВА 1
ОСНОВНЫЕ ПРИЕМЫ ПРОГРАММИРОВАНИЯ
31. Дано действительное число a. Не пользуясь никакими
другими арифметическими операциями, кроме умножения,
получить степени a⁴, a⁶, a⁷, a⁸, a⁹, a¹⁰, a¹³, a¹⁵, a²¹, a²⁸, a⁶⁴
с минимальным числом умножений.
"""

def main():
    """Вычисляет разные степени числа a с минимальным числом умножений."""
    try:
        a = float(input("Введите действительное число a: "))

        # a²
        a2 = a * a  # 1 операция

        # a⁴ = (a²)² — 2 операции
        a4 = a2 * a2
        print(f"a⁴ = {a4}")

        # a⁶ = (a³)² = (a² * a)² — 3 операции
        a3 = a2 * a
        a6 = a3 * a3
        print(f"a⁶ = {a6}")

        # a⁷ = a⁶ * a — 4 операции
        a7 = a6 * a
        print(f"a⁷ = {a7}")

        # a⁸ = (a⁴)² — 3 операции
        a8 = a4 * a4
        print(f"a⁸ = {a8}")

        # a⁹ = a⁶ * a³ — 4 операции
        a9 = a6 * a3
        print(f"a⁹ = {a9}")

        # a¹⁰ = a⁹ * a — 4 операции
        a10 = a9 * a
        print(f"a¹⁰ = {a10}")

        # a¹³ = a¹⁰ * a³ — 5 операций
        a13 = a10 * a3
        print(f"a¹³ = {a13}")

        # a¹⁵ = a¹³ * a² — 5 операций
        a15 = a13 * a2
        print(f"a¹⁵ = {a15}")

        # a²¹ = a¹³ * a⁸ — 6 операций
        a21 = a13 * a8
        print(f"a²¹ = {a21}")

        # a²⁸ = a²¹ * a⁷ — 6 операций
        a28 = a21 * a7
        print(f"a²⁸ = {a28}")

        # a⁶⁴ = ((((a²)²)²)²)²)² — 6 операций (через повторное возведение в квадрат)
        a4 = a2 * a2
        a8 = a4 * a4
        a16 = a8 * a8
        a32 = a16 * a16
        a64 = a32 * a32
        print(f"a⁶⁴ = {a64}")

    except ValueError:
        print("Ошибка: введите корректное число.")

    input("\nНажмите любую клавишу, чтобы завершить программу.")


if __name__ == "__main__":
    main()
