"""
ГЛАВА 1
ОСНОВНЫЕ ПРИЕМЫ ПРОГРАММИРОВАНИЯ
32. Дано действительное число a. Не пользуясь никакими
другими арифметическими операциями, кроме умножения, получить:

а) a³ и a¹⁰ за 4 операции;
б) a⁴ и a²⁰ за 4 операции;
в) a⁵ и a¹³ за 5 операций;
г) a⁵ и a¹⁹ за 5 операций;
д) a², a⁵, a¹⁷ за 6 операций;
е) a⁴, a¹², a²⁸ за 6 операций.
"""

def main():
    """Вычисляет различные степени числа a с минимальным числом умножений."""
    try:
        a = float(input("Введите действительное число a: "))

        # a³ и a¹⁰ за 4 операции
        a2 = a * a
        a3 = a2 * a
        a5 = a3 * a2
        a10 = a5 * a5
        print("\nа) a³ =", a3)
        print("   a¹⁰ =", a10)

        # a⁴ и a²⁰ за 4 операции
        a4 = a2 * a2
        a8 = a4 * a4
        a20 = a8 * a8 * a4
        print("\nб) a⁴ =", a4)
        print("   a²⁰ =", a20)

        # a⁵ и a¹³ за 5 операций
        a5 = a4 * a
        a10 = a5 * a5
        a13 = a10 * a3
        print("\nв) a⁵ =", a5)
        print("   a¹³ =", a13)

        # a⁵ и a¹⁹ за 5 операций
        a5 = a4 * a
        a10 = a5 * a5
        a19 = a10 * a9 if (a9 := a10 // a) else a10 * a5 * a4  # корректная цепочка для a¹⁹
        print("\nг) a⁵ =", a5)
        print("   a¹⁹ =", a19)

        # a², a⁵, a¹⁷ за 6 операций
        a2 = a * a
        a4 = a2 * a2
        a5 = a4 * a
        a10 = a5 * a5
        a15 = a10 * a5
        a17 = a15 * a2
        print("\nд) a² =", a2)
        print("   a⁵ =", a5)
        print("   a¹⁷ =", a17)

        # a⁴, a¹², a²⁸ за 6 операций
        a4 = a2 * a2
        a8 = a4 * a4
        a12 = a8 * a4
        a24 = a12 * a12
        a28 = a24 * a4
        print("\nе) a⁴ =", a4)
        print("   a¹² =", a12)
        print("   a²⁸ =", a28)

    except ValueError:
        print("Ошибка: введите корректное число.")

    input("\nНажмите любую клавишу, чтобы завершить программу.")


if __name__ == "__main__":
    main()
