"""
ГЛАВА 1
ОСНОВНЫЕ ПРИЁМЫ ПРОГРАММИРОВАНИЯ
12. Использование процедур 

В задачах этого параграфа будем для краткости говорить просто о процедурах, подразумевая, что решающий задачи сам выберет подходящее средство программирования – подпрограмму, функцию и 
т. д. Этот выбор должен быть сделан с учётом как характера задач, так и особенностей используемого языка программирования.

436. Даны целые числа n0, d0, n1, d1, ..., n7, d7, a, b (d0, d1...d7b != 0.
Вычислить по схеме Горнера n7 / d7 * (a / b) ^ 7 + n6 / d6 * (a / b) ^ 6 + ... + n0 / d0, определив процедуры полного сокращения рационального числа, заданного числителем и знаменателем, а также процедуры сложения и умножения рациональных чисел.
"""


import math
import random


# ------------------------------------------------------------
# Процедуры работы с рациональными числами
# ------------------------------------------------------------
def reduce_fraction(num, den):
    """Полное сокращение дроби num/den. Возвращает (числитель, знаменатель)."""
    if den == 0:
        raise ValueError("Знаменатель не может быть нулём.")
    if den < 0:
        num, den = -num, -den
    if num == 0:
        return 0, 1
    g = math.gcd(abs(num), den)
    return num // g, den // g


def mul_frac(f1, f2):
    """Умножение двух рациональных чисел f1 = (n1, d1), f2 = (n2, d2)."""
    n1, d1 = f1
    n2, d2 = f2
    return reduce_fraction(n1 * n2, d1 * d2)


def add_frac(f1, f2):
    """Сложение двух рациональных чисел f1 = (n1, d1), f2 = (n2, d2)."""
    n1, d1 = f1
    n2, d2 = f2
    return reduce_fraction(n1 * d2 + n2 * d1, d1 * d2)


# ------------------------------------------------------------
# Схема Горнера
# ------------------------------------------------------------
def evaluate_horner(coeffs, x_frac):
    """
    coeffs – список кортежей (n_k, d_k) от старшей степени к младшей (k = 7..0).
    x_frac – кортеж (a, b) = a/b.
    Возвращает сокращённую дробь (числитель, знаменатель).
    """
    result = coeffs[0]  # старший коэффициент
    for i in range(1, len(coeffs)):
        result = add_frac(mul_frac(result, x_frac), coeffs[i])
    return result


# ------------------------------------------------------------
# Ввод данных
# ------------------------------------------------------------
def get_data():
    """Выбор способа ввода 18 чисел: 8 пар (n_i, d_i) и a, b."""
    print("Задача 436: Схема Горнера для рациональных чисел")
    print("Выберите способ ввода:")
    print("1 — Ручной ввод")
    print("2 — Случайная генерация")
    print("3 — Готовые примеры")

    while True:
        choice = input("Ваш выбор (1/2/3): ").strip()
        if choice in ('1', '2', '3'):
            break
        print("Ошибка: выберите 1, 2 или 3.")

    if choice == '1':
        while True:
            try:
                print("Введите 18 целых чисел через пробел:")
                print("n7 d7 n6 d6 ... n1 d1 n0 d0 a b")
                data = list(map(int, input().split()))
                if len(data) != 18:
                    print("Ошибка: нужно ровно 18 чисел.")
                    continue
                # Проверка нулевых знаменателей
                for i in range(1, 17, 2):
                    if data[i] == 0:
                        print(f"Ошибка: знаменатель d[{i // 2}] равен 0.")
                        break
                else:
                    if data[17] == 0:
                        print("Ошибка: b (знаменатель x) равен 0.")
                    else:
                        return data
            except ValueError:
                print("Ошибка ввода. Введите целые числа.")

    elif choice == '2':
        # Генерируем случайные ненулевые знаменатели
        data = []
        for _ in range(8):
            n = random.randint(-5, 5)
            d = random.randint(1, 7) * random.choice([-1, 1])  # d != 0
            data.extend([n, d])
        a = random.randint(-5, 5)
        b = random.randint(1, 7) * random.choice([-1, 1])
        data.extend([a, b])
        print("Сгенерированы числа:", data)
        return data

    else:  # готовые примеры
        examples = [
            [1,1, 1,2, 0,1, 0,1, 0,1, 0,1, 0,1, 0,1,  2,3],  # (1/1)*(2/3)^7 + (1/2)*(2/3)^6 + 0...
            [0,1, 0,1, 0,1, 0,1, 0,1, 0,1, 0,1, 1,1,  1,2],  # только свободный член 1/1
            [1,2, 2,3, 3,4, 4,5, 5,6, 6,7, 7,8, 8,9,  1,1],  # все коэффициенты и x=1
        ]
        print("Готовые примеры:")
        for idx, arr in enumerate(examples, 1):
            print(f"{idx}: {arr}")
        while True:
            try:
                num = int(input("Выберите номер примера: "))
                if 1 <= num <= len(examples):
                    return examples[num - 1]
                else:
                    print(f"Номер от 1 до {len(examples)}.")
            except ValueError:
                print("Введите целое число.")


# ------------------------------------------------------------
# Основная программа
# ------------------------------------------------------------
def main():
    data = get_data()

    # Извлекаем коэффициенты (n_k, d_k) для k = 7..0
    coeffs = []
    for i in range(0, 16, 2):
        n_k, d_k = data[i], data[i + 1]
        # сокращаем каждый коэффициент сразу
        coeffs.append(reduce_fraction(n_k, d_k))

    a, b = data[16], data[17]
    x_frac = reduce_fraction(a, b)

    result = evaluate_horner(coeffs, x_frac)
    num, den = result

    print("\nРезультаты:")
    print(f"Коэффициенты (n_k / d_k): {[f'{n} / {d}' for n,d in coeffs]}")
    print(f"x = {a} / {b}")
    if den == 1:
        print(f"Значение полинома = {num}")
    else:
        print(f"Значение полинома = {num} / {den}")


if __name__ == "__main__":
    main()
    input("\nНажмите Enter, чтобы завершить программу.")
