"""
ГЛАВА 1
ОСНОВНЫЕ ПРИЁМЫ ПРОГРАММИРОВАНИЯ
12. Использование процедур 

В задачах этого параграфа будем для краткости говорить просто о процедурах, подразумевая, что решающий задачи сам выберет подходящее средство программирования – подпрограмму, функцию и 
т. д. Этот выбор должен быть сделан с учётом как характера задач, так и особенностей используемого языка программирования.

438. Даны натуральное число n, действительные числа x, y, an, bn, an - 1, bn - 1, ..., a0, b0. Вычислить по схеме Горнера значение многочлена с комплексными коэффициентами
(an + i * bn) * (x + i * y) ^ n + (an - 1 + i * bn - 1)(x + i * y) ^ n - 1 + ... + (a0 + i * b0).
(Определить процедуры выполнения арифметических операций над комплексными числами.)
"""


import random


# ------------------------------------------------------------
# Процедуры для работы с комплексными числами
# ------------------------------------------------------------
def add_complex(c1, c2):
    """Сложение двух комплексных чисел (re, im)."""
    return (c1[0] + c2[0], c1[1] + c2[1])


def mul_complex(c1, c2):
    """Умножение двух комплексных чисел (re, im)."""
    # (a + bi) * (c + di) = (ac - bd) + (ad + bc)i
    re = c1[0] * c2[0] - c1[1] * c2[1]
    im = c1[0] * c2[1] + c1[1] * c2[0]
    return (re, im)


# ------------------------------------------------------------
# Схема Горнера для комплексного многочлена
# ------------------------------------------------------------
def horner_complex(x, y, coeffs):
    """
    coeffs – список пар (a_k, b_k) от старшей степени к младшей.
    Возвращает значение многочлена в точке z = x + iy.
    """
    z = (x, y)
    res = coeffs[0]   # старший коэффициент
    for k in range(1, len(coeffs)):
        res = add_complex(mul_complex(res, z), coeffs[k])
    return res


# ------------------------------------------------------------
# Ввод данных
# ------------------------------------------------------------
def get_data():
    """Выбор способа ввода n, x, y и коэффициентов."""
    print("Задача 438: Многочлен с комплексными коэффициентами (схема Горнера)")
    print("Выберите способ ввода:")
    print("1 — Ручной ввод")
    print("2 — Случайная генерация")
    print("3 — Готовые примеры")

    while True:
        choice = input("Ваш выбор (1/2/3): ").strip()
        if choice in ('1', '2', '3'):
            break
        print("Ошибка: выберите 1, 2 или 3.")

    if choice == '1':
        while True:
            try:
                print("Введите через пробел: n x y")
                print("затем пары a_n b_n  a_{n - 1} b_{n - 1}  ...  a_0 b_0")
                data = list(map(float, input().split()))
                if len(data) < 3:
                    print("Ошибка: нужно хотя бы n, x, y.")
                    continue
                n = int(data[0])
                if n < 0:
                    print("n должно быть >= 0.")
                    continue
                x, y = data[1], data[2]
                # должно быть ещё 2 * (n + 1) чисел
                if len(data) != 3 + 2 * (n + 1):
                    print(f"Ожидалось {3 + 2 * (n + 1)} чисел, введено {len(data)}.")
                    continue
                coeffs = []
                idx = 3
                for _ in range(n + 1):
                    a_k, b_k = data[idx], data[idx + 1]
                    coeffs.append((a_k, b_k))
                    idx += 2
                return n, x, y, coeffs
            except ValueError:
                print("Ошибка ввода. Повторите.")

    elif choice == '2':
        n = random.randint(1, 4)
        x = round(random.uniform(-3, 3), 2)
        y = round(random.uniform(-3, 3), 2)
        coeffs = []
        for _ in range(n + 1):
            a = round(random.uniform(-3, 3), 2)
            b = round(random.uniform(-3, 3), 2)
            coeffs.append((a, b))
        print(f"Сгенерированы: n = {n}, x = {x}, y = {y}")
        print("Коэффициенты (a_k, b_k):", coeffs)
        return n, x, y, coeffs

    else:  # готовые примеры
        examples = [
            (1, 2.0, 0.0, [(1.0, 0.0), (2.0, 0.0)]),   # x = 2, полином 1 * z + 2 => z + 2 = 4
            (2, 0.0, 1.0, [(1.0, 0.0), (0.0, 1.0), (1.0, 0.0)]),  # z = i, полином z^2 + i * z + 1
            (2, 1.0, -1.0, [(0.0, 1.0), (2.0, 0.0), (1.0, 1.0)]), # z = 1 - i
        ]
        print("Готовые примеры:")
        for idx, (n_val, xv, yv, cf) in enumerate(examples, 1):
            print(f"{idx}: n = {n_val}, x = {xv}, y = {yv}, coeffs = {cf}")
        while True:
            try:
                num = int(input("Выберите номер примера: "))
                if 1 <= num <= len(examples):
                    return examples[num - 1]
                else:
                    print(f"Номер от 1 до {len(examples)}.")
            except ValueError:
                print("Введите целое число.")


# ------------------------------------------------------------
# Основная программа
# ------------------------------------------------------------
def main():
    n, x, y, coeffs = get_data()

    result = horner_complex(x, y, coeffs)
    re, im = result

    print("\nРезультаты:")
    print(f"n = {n}")
    print(f"z = {x} + ({y})i")
    print("Коэффициенты (a_k + i · b_k):", coeffs)
    if im >= 0:
        print(f"Значение многочлена: {re:.6f} + {im:.6f}i")
    else:
        print(f"Значение многочлена: {re:.6f} - {abs(im):.6f}i")


if __name__ == "__main__":
    main()
    input("\nНажмите Enter, чтобы завершить программу.")
