"""
ГЛАВА 1
ОСНОВНЫЕ ПРИЁМЫ ПРОГРАММИРОВАНИЯ
9. Вычисления с хранением последовательности значений

283. Даны действительные числа a1, …, a17. Получить: 
а) a17, a1, a2, …, a16;
б) a11, a12, …, a17, a1, a2, …, a10;
в) a11, a12, …, a17, a10, a9, …, a1;
"""


def main():
    n = 17  # количество элементов
    
    # Ввод последовательности
    a = []
    for i in range(n):
        while True:
            try:
                value = float(input(f"Введите действительное число a_{i+1}: "))
                a.append(value)
                break
            except ValueError:
                print("Ошибка: введите действительное число (например, 3.14)")
    
    print(f"\nИсходная последовательность: {a}")
    
    # а) a17, a1, a2, ..., a16
    result_a = [a[-1]] + a[:-1]
    print(f"\nа) a17, a1, a2, ..., a16:")
    print(result_a)
    
    # б) a11, a12, ..., a17, a1, a2, ..., a10
    # Индексы: 10-16 (a11-a17), затем 0-9 (a1-a10)
    result_b = a[10:] + a[:10]
    print(f"\nб) a11, a12, ..., a17, a1, a2, ..., a10:")
    print(result_b)
    
    # в) a11, a12, ..., a17, a10, a9, ..., a1
    # Первая часть: a[10:] - элементы с 11 по 17
    # Вторая часть: a[9::-1] - элементы с 10 по 1 в обратном порядке
    result_c = a[10:] + a[9::-1]
    print(f"\nв) a11, a12, ..., a17, a10, a9, ..., a1:")
    print(result_c)

if __name__ == "__main__":
    main()
    input("\n\nНажмите Enter, чтобы завершить программу.")
