"""
ГЛАВА 1
ОСНОВНЫЕ ПРИЁМЫ ПРОГРАММИРОВАНИЯ
6. Пошаговый ввод данных и вывод результатов *)

138. Даны действительные числа a1, ..., a70. Получить(вывести) последовательность a2, a3, ..., a70, a1.
"""


def main():
    print("Введите 70 действительных чисел:")
    
    # Запоминаем первое число
    a1 = float(input("a1 = "))
    
    # Вводим и сразу выводим числа со 2 по 70
    for i in range(2, 71):
        a = float(input(f"a{i} = "))
        print(f"Выведено: {a}")
    
    # Выводим первое число в конце
    print(f"Выведено: {a1}")
    print("\nПоследовательность a2, a3, ..., a70, a1 успешно выведена!")

if __name__ == "__main__":
    main()
    input("\n\nНажмите Enter, чтобы завершить программу.")
