"""
ГЛАВА 1
ОСНОВНЫЕ ПРИЁМЫ ПРОГРАММИРОВАНИЯ
6. Пошаговый ввод данных и вывод результатов *)

147. Вычислить последовательности значений функций p1 * (x) = x, p2 * (x) = (3 * x * x - 1) / 2, p3 * (x) = (5 * x * x - 3 * x) / 2 для значений аргумента x = 0,0.05, 0.1, ..., 20.
"""


def main():
    print("Вычисление последовательностей значений функций")
    print("=" * 80)
    print("Функции:")
    print("p1(x) = x")
    print("p2(x) = (3x² - 1)/2")
    print("p3(x) = (5x² - 3x)/2")
    print("для x = 0, 0.05, 0.1, ..., 20")
    print("=" * 80)
    
    # Параметры вычислений
    start = 0.0
    end = 20.0
    step = 0.05
    
    # Вычисляем количество точек
    # Чтобы избежать ошибок округления при работе с float,
    # используем целочисленный счетчик
    num_points = int((end - start) / step) + 1
    
    print(f"Количество точек: {num_points}")
    print(f"Шаг: {step}")
    print("=" * 80)
    
    # Создаем списки для хранения значений (опционально, для анализа)
    x_values = []
    p1_values = []
    p2_values = []
    p3_values = []
    
    # Вывод таблицы значений (первые 20 и последние 5 значений для наглядности)
    print("\nТаблица значений (первые 20 точек):")
    print("-" * 70)
    print(f"{'x':>8} | {'p1(x)':>12} | {'p2(x)':>12} | {'p3(x)':>12}")
    print("-" * 70)
    
    count = 0
    x = start
    while x <= end + step/2:  # Добавляем step/2 для учета погрешности округления
        # Вычисляем значения функций
        p1 = x
        p2 = (3 * x * x - 1) / 2
        p3 = (5 * x * x - 3 * x) / 2
        
        # Сохраняем значения
        x_values.append(x)
        p1_values.append(p1)
        p2_values.append(p2)
        p3_values.append(p3)
        
        # Выводим первые 20 точек
        if count < 20:
            print(f"{x:8.3f} | {p1:12.6f} | {p2:12.6f} | {p3:12.6f}")
        
        count += 1
        x = start + count * step  # Более точное вычисление следующего x
    
    print("...")
    
    # Выводим последние 5 точек
    print("\nПоследние 5 точек:")
    print("-" * 70)
    print(f"{'x':>8} | {'p1(x)':>12} | {'p2(x)':>12} | {'p3(x)':>12}")
    print("-" * 70)
    
    for i in range(max(0, len(x_values) - 5), len(x_values)):
        print(f"{x_values[i]:8.3f} | {p1_values[i]:12.6f} | {p2_values[i]:12.6f} | {p3_values[i]:12.6f}")
    
    # Анализ функций
    print("\n" + "=" * 80)
    print("Анализ функций:")
    print("-" * 80)
    
    # Находим корни уравнений p2(x) = 0 и p3(x) = 0
    print("\nКорни уравнений:")
    
    # p2(x) = (3x² - 1)/2 = 0 => 3x² - 1 = 0 => x² = 1/3 => x = ±√(1/3) ≈ ±0.57735
    print("p2(x) = 0: (3x² - 1)/2 = 0 => x = ±√(1/3) ≈ ±0.57735")
    
    # p3(x) = (5x² - 3x)/2 = 0 => x(5x - 3) = 0 => x = 0 или x = 3/5 = 0.6
    print("p3(x) = 0: (5x² - 3x)/2 = 0 => x(5x - 3) = 0 => x = 0 или x = 3/5 = 0.6")
    
    # Экстремумы функций
    print("\nЭкстремумы:")
    print("p1(x) = x - линейная функция, экстремумов нет")
    print("p2(x): производная = 3x, критическая точка при x = 0")
    print("       p2(0) = -0.5 (минимум)")
    print("p3(x): производная = (10x - 3)/2, критическая точка при x = 0.3")
    print(f"       p3(0.3) = {(5*0.3*0.3 - 3*0.3)/2:.6f}")
    
    # Значения функций в характерных точках
    print("\nЗначения в характерных точках:")
    characteristic_points = [0.0, 0.3, 0.57735, 0.6, 1.0, 5.0, 10.0, 20.0]
    
    print(f"{'x':>8} | {'p1(x)':>12} | {'p2(x)':>12} | {'p3(x)':>12}")
    print("-" * 70)
    
    for x in characteristic_points:
        p1 = x
        p2 = (3 * x * x - 1) / 2
        p3 = (5 * x * x - 3 * x) / 2
        print(f"{x:8.3f} | {p1:12.6f} | {p2:12.6f} | {p3:12.6f}")
    
    # Сравнение функций
    print("\n" + "=" * 80)
    print("Сравнение функций:")
    print("-" * 80)
    
    # Проверяем, где p1(x) = p2(x), p1(x) = p3(x), p2(x) = p3(x)
    print("\nТочки пересечения функций (приближенно):")
    
    # Ищем точки пересечения среди вычисленных значений
    tolerance = 0.001
    
    # p1(x) = p2(x) => x = (3x² - 1)/2 => 2x = 3x² - 1 => 3x² - 2x - 1 = 0
    # Решаем квадратное уравнение
    print("p1(x) = p2(x): 3x² - 2x - 1 = 0")
    print("  D = 4 + 12 = 16")
    print("  x1 = (2 - 4)/6 = -1/3 ≈ -0.3333")
    print("  x2 = (2 + 4)/6 = 1")
    print("  В нашем диапазоне [0, 20] есть точка x = 1")
    
    # p1(x) = p3(x) => x = (5x² - 3x)/2 => 2x = 5x² - 3x => 5x² - 5x = 0 => 5x(x - 1) = 0
    print("\np1(x) = p3(x): 5x² - 5x = 0 => 5x(x - 1) = 0")
    print("  x1 = 0, x2 = 1")
    
    # p2(x) = p3(x) => (3x² - 1)/2 = (5x² - 3x)/2 => 3x² - 1 = 5x² - 3x => 2x² - 3x + 1 = 0
    print("\np2(x) = p3(x): 2x² - 3x + 1 = 0")
    print("  D = 9 - 8 = 1")
    print("  x1 = (3 - 1)/4 = 0.5")
    print("  x2 = (3 + 1)/4 = 1")
    
    # Графическое представление (текстовое)
    print("\n" + "=" * 80)
    print("Текстовый график функций (масштаб 0..10):")
    print("-" * 80)
    
    # Выводим небольшой график для x от 0 до 10 с шагом 1
    print(f"{'x':>5} | {'p1':>7} {'p2':>7} {'p3':>7}")
    print("-" * 80)
    
    for x in range(0, 11):
        p1 = x
        p2 = (3 * x * x - 1) / 2
        p3 = (5 * x * x - 3 * x) / 2
        
        # Создаем простые строковые представления
        p1_str = f"{p1:7.2f}"
        p2_str = f"{p2:7.2f}"
        p3_str = f"{p3:7.2f}"
        
        print(f"{x:5} | {p1_str} {p2_str} {p3_str}")

if __name__ == "__main__":
    main()
    input("\n\nНажмите Enter, чтобы завершить программу.")
